Конфигурация/AccumulationRegisters/ДолиПайщиковВИнвестиционномФонде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДолиПайщиковВИнвестиционномФонде</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Comment>Дата записи в миллисекундах, для контроля последовательности проведения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Documents/ЗачислениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗачислениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНадбавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСПартиямиДолейПайщиков/Ext/Module.bsl
Функция ПолучитьОстаткиПартий(МоментВремени, Организация, ПаевойИнвестиционныйФонд, Пайщик, ЭтоПроведениеДокумента = Истина) Экспорт
	
	Если ЭтоПроведениеДокумента Тогда
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДолиПайщиковВИнвестиционномФонде");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
		ЭлементБлокировки.УстановитьЗначение("ПаевойИнвестиционныйФонд", ПаевойИнвестиционныйФонд);
		ЭлементБлокировки.УстановитьЗначение("Пайщик", Пайщик);
		
		Блокировка.Заблокировать();
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДолиПайщиковВИнвестиционномФондеОстатки.Партия КАК Партия,
	|	ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток КАК Количество,
	|	ДолиПайщиковВИнвестиционномФондеОстатки.СтоимостьОстаток КАК Стоимость,
	|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик КАК Пайщик
	|ИЗ
	|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд
	|				И Пайщик = &Пайщик) КАК ДолиПайщиковВИнвестиционномФондеОстатки
	|ГДЕ
	|	ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДолиПайщиковВИнвестиционномФондеОстатки.Партия.МоментВремени");
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("Пайщик", Пайщик);
	
	ТаблицаПартий = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПартий;
	
КонецФункции

Функция ПодобратьПартии(Регистратор, ДанныеСписания, ТаблицаПартий, Отказ) Экспорт
	
	Если ТипЗнч(ДанныеСписания) = Тип("Число") Тогда
		ТаблицаСписания			= ТаблицаПартий.СкопироватьКолонки();
		НоваяСтрока				= ТаблицаСписания.Добавить();
		НоваяСтрока.Количество	= ДанныеСписания;		
		Количество				= ДанныеСписания;
	Иначе
		ТаблицаСписания	= ДанныеСписания.Скопировать();
		Количество		= ТаблицаСписания.Итог("Количество");
	КонецЕсли;	                                           	
	
	ТаблицаРезультата = ТаблицаПартий.СкопироватьКолонки();
	
	Если Количество <= 0 Тогда
		Возврат ТаблицаРезультата;	
	КонецЕсли;
		
	КоличествоНаОстатках = ТаблицаПартий.Итог("Количество");
	Если Количество > КоличествоНаОстатках Тогда
		
		// Недостаточно остатков партий
		ТекстСообщения = "Недостаточно количество паев для списания. Требуется " + Формат(Количество, "ЧН=0") + " по данным учета " + Формат(КоличествоНаОстатках, "ЧН=0");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Регистратор, "Количество", "Объект", Отказ);
		
		Возврат ТаблицаРезультата;
		
	КонецЕсли;
	
	ИндексСтрокиСписания = 0;
	ИндексПоследнейСтрокиСписания = ТаблицаСписания.Количество() - 1;
	
	ИндексСтрокиПартий = 0;
	ИндексПоследнейСтрокиПартий = ТаблицаПартий.Количество() - 1;
	
	Пока ИндексСтрокиПартий <= ИндексПоследнейСтрокиПартий Цикл
		
		СтрокаПартия = ТаблицаПартий[ИндексСтрокиПартий];
				
		СтрокаТаблицыСписания = ТаблицаСписания[ИндексСтрокиСписания];
		
		СтрокаРезультат = ТаблицаРезультата.Добавить();
		
		СтрокаРезультат.Партия = СтрокаПартия.Партия;
		СтрокаРезультат.Пайщик = ?(ЗначениеЗаполнено(СтрокаТаблицыСписания.Пайщик), СтрокаТаблицыСписания.Пайщик, СтрокаПартия.Пайщик);
		
		СтрокаРезультат.Количество = Мин(СтрокаПартия.Количество, СтрокаТаблицыСписания.Количество);
		СтрокаРезультат.Стоимость  = СтрокаПартия.Стоимость * СтрокаРезультат.Количество / СтрокаПартия.Количество;
				
		СтрокаПартия.Количество				= СтрокаПартия.Количество - СтрокаРезультат.Количество;				
		СтрокаТаблицыСписания.Количество	= СтрокаТаблицыСписания.Количество - СтрокаРезультат.Количество;
		СтрокаПартия.Стоимость				= СтрокаПартия.Стоимость - СтрокаРезультат.Стоимость;;
		
		Если СтрокаТаблицыСписания.Количество = 0 Тогда
			ИндексСтрокиСписания = ИндексСтрокиСписания + 1;
		КонецЕсли;
		
		Если СтрокаПартия.Количество = 0 Тогда
			
			// Списываем погрешность по партии на текущую строку, т. к. это ни на что не влияет
			Если СтрокаПартия.Стоимость <> 0 Тогда
				СтрокаРезультат.Стоимость = СтрокаРезультат.Стоимость - СтрокаПартия.Стоимость;
			КонецЕсли;
			
			ИндексСтрокиПартий = ИндексСтрокиПартий + 1;
			
		КонецЕсли;
		
		Если ИндексСтрокиСписания > ИндексПоследнейСтрокиСписания Тогда
			Прервать;	
		КонецЕсли;
		
	КонецЦикла;	
		
	Возврат ТаблицаРезультата;
	
КонецФункции

Процедура ПроверитьИзменениеДатыДокумента(ДокументОбъект, РежимЗаписи) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ ДокументОбъект.ЭтоНовый() 
		И ДокументОбъект.Проведен Тогда
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", ДокументОбъект.Дата > ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Ссылка, "Дата"));
		
	Иначе
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДвиженияПоПартиямПриНеобходимости(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед")
		и ДокументОбъект.ДополнительныеСвойства.ДатаДокументаСдвинутаВперед Тогда
		
		НаборЗаписей = РегистрыНакопления.ДолиПайщиковВИнвестиционномФонде.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВосстановитьПартии(ПаевойИнвестиционныйФонд = Неопределено, Пайщик = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДолиПайщиковВИнвестиционномФонде.Пайщик КАК Пайщик,
	|	ДолиПайщиковВИнвестиционномФонде.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	ДолиПайщиковВИнвестиционномФонде.Период КАК Период,
	|	ДолиПайщиковВИнвестиционномФонде.ПериодЗаписи КАК ПериодЗаписи,
	|	ДолиПайщиковВИнвестиционномФонде.Регистратор КАК Регистратор,
	|	ДолиПайщиковВИнвестиционномФонде.ВидДвижения КАК ВидДвижения
	|ПОМЕСТИТЬ _ТаблицаРегистра
	|ИЗ
	|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде КАК ДолиПайщиковВИнвестиционномФонде
	|ГДЕ
	|	ДолиПайщиковВИнвестиционномФонде.Организация = &Организация
	|	И &ПаевойИнвестиционныйФонд В (ДолиПайщиковВИнвестиционномФонде.ПаевойИнвестиционныйФонд, ЗНАЧЕНИЕ(Справочник.ПаевыеИнвестиционныеФонды.ПустаяСсылка))
	|	И &Пайщик В (ДолиПайщиковВИнвестиционномФонде.Пайщик, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Пайщик,
	|	ПаевойИнвестиционныйФонд,
	|	ПериодЗаписи,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ТаблицаРегистра.Пайщик КАК Пайщик,
	|	_ТаблицаРегистра.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	МИНИМУМ(_ТаблицаРегистра.Период) КАК Период
	|ПОМЕСТИТЬ _ЗаписиДляАнализа
	|ИЗ
	|	_ТаблицаРегистра КАК _ТаблицаРегистра
	|ГДЕ
	|	ИСТИНА В
	|			(ВЫБРАТЬ
	|				ИСТИНА
	|			ИЗ
	|				_ТаблицаРегистра КАК Т
	|			ГДЕ
	|				Т.Пайщик = _ТаблицаРегистра.Пайщик
	|				И Т.ПаевойИнвестиционныйФонд = _ТаблицаРегистра.ПаевойИнвестиционныйФонд
	|				И (Т.Период = _ТаблицаРегистра.Период
	|						И Т.Регистратор < _ТаблицаРегистра.Регистратор
	|					ИЛИ Т.Период < _ТаблицаРегистра.Период)
	|				И Т.ПериодЗаписи > _ТаблицаРегистра.ПериодЗаписи)
	|
	|СГРУППИРОВАТЬ ПО
	|	_ТаблицаРегистра.Пайщик,
	|	_ТаблицаРегистра.ПаевойИнвестиционныйФонд
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Пайщик,
	|	ПаевойИнвестиционныйФонд,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЗаписиДляАнализа.Пайщик КАК Пайщик,
	|	_ЗаписиДляАнализа.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	_ЗаписиДляАнализа.Период КАК Период,
	|	МИНИМУМ(_ТаблицаРегистра.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ _ДокументыГраницы
	|ИЗ
	|	_ЗаписиДляАнализа КАК _ЗаписиДляАнализа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаРегистра КАК _ТаблицаРегистра
	|		ПО _ЗаписиДляАнализа.Пайщик = _ТаблицаРегистра.Пайщик
	|			И _ЗаписиДляАнализа.ПаевойИнвестиционныйФонд = _ТаблицаРегистра.ПаевойИнвестиционныйФонд
	|			И _ЗаписиДляАнализа.Период = _ТаблицаРегистра.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЗаписиДляАнализа.Пайщик,
	|	_ЗаписиДляАнализа.ПаевойИнвестиционныйФонд,
	|	_ЗаписиДляАнализа.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Пайщик,
	|	ПаевойИнвестиционныйФонд,
	|	Период,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ТаблицаРегистра.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	_ТаблицаРегистра.Пайщик КАК Пайщик,
	|	_ТаблицаРегистра.Регистратор КАК Регистратор,
	|	_ТаблицаРегистра.ВидДвижения КАК ВидДвижения,
	|	_ТаблицаРегистра.Период КАК Период
	|ИЗ
	|	_ДокументыГраницы КАК _ДокументыГраницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаРегистра КАК _ТаблицаРегистра
	|		ПО _ДокументыГраницы.Пайщик = _ТаблицаРегистра.Пайщик
	|			И _ДокументыГраницы.ПаевойИнвестиционныйФонд = _ТаблицаРегистра.ПаевойИнвестиционныйФонд
	|			И _ДокументыГраницы.Период = _ТаблицаРегистра.Период
	|			И _ДокументыГраницы.Регистратор <= _ТаблицаРегистра.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ТаблицаРегистра.ПаевойИнвестиционныйФонд,
	|	_ТаблицаРегистра.Пайщик,
	|	_ТаблицаРегистра.Регистратор,
	|	_ТаблицаРегистра.ВидДвижения,
	|	_ТаблицаРегистра.Период
	|ИЗ
	|	_ДокументыГраницы КАК _ДокументыГраницы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаРегистра КАК _ТаблицаРегистра
	|		ПО _ДокументыГраницы.Пайщик = _ТаблицаРегистра.Пайщик
	|			И _ДокументыГраницы.ПаевойИнвестиционныйФонд = _ТаблицаРегистра.ПаевойИнвестиционныйФонд
	|			И _ДокументыГраницы.Период < _ТаблицаРегистра.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор
	|ИТОГИ ПО
	|	ПаевойИнвестиционныйФонд,
	|	Пайщик");
	
	Запрос.УстановитьПараметр("Организация",              ПараметрыСеанса.ТекущаяОрганизация);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ?(ПаевойИнвестиционныйФонд = Неопределено, Справочники.ПаевыеИнвестиционныеФонды.ПустаяСсылка(), ПаевойИнвестиционныйФонд));
	Запрос.УстановитьПараметр("Пайщик",                   ?(Пайщик = Неопределено, Справочники.ЮрФизЛица.ПустаяСсылка(), Пайщик));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписей = РегистрыНакопления.ДолиПайщиковВИнвестиционномФонде.СоздатьНаборЗаписей();
	
	ВыборкаПИФ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПаевойИнвестиционныйФонд");
	Пока ВыборкаПИФ.Следующий() Цикл
		
		ВыборкаПайщик = ВыборкаПИФ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Пайщик");
		
		Пока ВыборкаПайщик.Следующий() Цикл
			
			Выборка = ВыборкаПайщик.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ВидДвижения = ВидДвиженияНакопления.Приход
					или ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
					
					НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
					НаборЗаписей.Прочитать();
					НаборЗаписей.Записать();
					
				Иначе
					
					НачатьТранзакцию();
					
					Отказ = Ложь;
					
					ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
					ДокументОбъект.ДвиженияПоРегиструДолиПайщиков(Отказ);
					
					Если Отказ Тогда
						ВызватьИсключение "Ошибка списания партий: " + Выборка.Регистратор;
					Иначе
						ДокументОбъект.Движения.ДолиПайщиковВИнвестиционномФонде.Записать();
					КонецЕсли;
					
					ЗафиксироватьТранзакцию();
					
				КонецЕсли;					
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РассчитатьПартииИСкидки(ДокументОбъект, ПараметрыСкидок = Неопределено, Отказ = Ложь) Экспорт
		
	ОстаткиПартий  = РаботаСПартиямиДолейПайщиков.ПолучитьОстаткиПартий(ДокументОбъект.Дата, ДокументОбъект.Организация, ДокументОбъект.ПаевойИнвестиционныйФонд, ДокументОбъект.Пайщик, Ложь);
	СписанныеПартии = РаботаСПартиямиДолейПайщиков.ПодобратьПартии(ДокументОбъект, ДокументОбъект.Количество, ОстаткиПартий, Отказ);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ШкалаСкидок = ?(ПараметрыСкидок.ПрименяютсяНадбавкиИСкидки, ПараметрыСкидок.ШкалаСкидок, Неопределено);
			
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписанныеПартии.Партия КАК ЗачислениеПаев,
		|	СписанныеПартии.Количество КАК КоличествоПаев,
		|	СписанныеПартии.Стоимость КАК СтоимостьПокупки
		|ПОМЕСТИТЬ _СписанныеПартииБезСрокаВладения
		|ИЗ
		|	&СписанныеПартии КАК СписанныеПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписанныеПартииБезСрокаВладения.ЗачислениеПаев КАК ЗачислениеПаев,
		|	_СписанныеПартииБезСрокаВладения.КоличествоПаев КАК КоличествоПаев,
		|	РАЗНОСТЬДАТ(ВЫРАЗИТЬ(_СписанныеПартииБезСрокаВладения.ЗачислениеПаев КАК Документ.ЗачислениеПаев).Дата, &Дата, ДЕНЬ) КАК СрокВладения,
		|	_СписанныеПартииБезСрокаВладения.СтоимостьПокупки КАК СтоимостьПокупки
		|ПОМЕСТИТЬ _СписанныеПартии
		|ИЗ
		|	_СписанныеПартииБезСрокаВладения КАК _СписанныеПартииБезСрокаВладения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписанныеПартии.ЗачислениеПаев КАК ЗачислениеПаев,
		|	_СписанныеПартии.СрокВладения КАК СрокВладения,
		|	_СписанныеПартии.КоличествоПаев КАК КоличествоПаев,
		|	_СписанныеПартии.СтоимостьПокупки КАК СтоимостьПокупки,
		|	ЕСТЬNULL(Шкала.ПроцентнаяСтавка, 0) КАК ПроцентСкидки,
		|	ВЫБОР
		|		КОГДА &ПрименяетсяСкидка
		|			ТОГДА ВЫРАЗИТЬ(Шкала.ПроцентнаяСтавка / 100 * &СтоимостьПая * _СписанныеПартии.КоличествоПаев КАК ЧИСЛО(21, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаСкидки,
		|	&СтоимостьПая * _СписанныеПартии.КоличествоПаев КАК СуммаПогашения
		|ИЗ
		|	_СписанныеПартии КАК _СписанныеПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыПроцентныхСтавок.Шкала КАК Шкала
		|		ПО (ВЫБОР
		|				КОГДА &ПрименяетсяСкидка
		|					ТОГДА Шкала.Ссылка = &ШкалаСкидок
		|							И (Шкала.МинимальноеЗначение < _СписанныеПартии.СрокВладения
		|								ИЛИ Шкала.МинимальноеЗначение = 0)
		|							И (Шкала.МаксимальноеЗначение >= _СписанныеПартии.СрокВладения
		|								ИЛИ Шкала.МаксимальноеЗначение = 0)
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)");
	
	Запрос.УстановитьПараметр("Дата",					КонецДня(ДокументОбъект.Дата));
	Запрос.УстановитьПараметр("ПрименяетсяСкидка",		ПараметрыСкидок.ПрименяютсяНадбавкиИСкидки);
	Запрос.УстановитьПараметр("ШкалаСкидок",			ШкалаСкидок);	
	Запрос.УстановитьПараметр("СписанныеПартии",		СписанныеПартии);
	Запрос.УстановитьПараметр("СтоимостьПая",			ПараметрыСкидок.РасчетнаяСтоимостьПая);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции
